taskt/Core/Automation/Commands/DateTimeGroup/IDateTimeConvertProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IDateTimeConvertProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.ADateTimeConvertCommands" [ label="ADateTimeConvertCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IDateTimeConvertProperties" [ label="IDateTimeConvertProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AFormatDateTimeCommands" [ label="AFormatDateTimeCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ACalculateDateTimeCommands" [ label="ACalculateDateTimeCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ConvertDateTimeToUnixTimelCommand" [ label="ConvertDateTimeToUnixTimelCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertDateTimeToExcelSerialCommand" [ label="ConvertDateTimeToExcelSerialCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.FormatDateTimeByUnixTimeCommand" [ label="FormatDateTimeByUnixTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.FormatDateTimeByExcelSerialCommand" [ label="FormatDateTimeByExcelSerialCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.FormatDateTimeByTextCommand" [ label="FormatDateTimeByTextCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.FormatDateTimeCommand" [ label="FormatDateTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands" [ label="AGetFormattedDateTimeFromCalculatedDateTimeCommands", style="dashed", ];
"taskt.Core.Automation.Commands.CalculateDateTimeFromUnixTimeCommand" [ label="CalculateDateTimeFromUnixTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CalculateDateTimeFromExcelSerialCommand" [ label="CalculateDateTimeFromExcelSerialCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CalculateDateTimeFromTextCommand" [ label="CalculateDateTimeFromTextCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CalculateDateTimeCommand" [ label="CalculateDateTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedExcelSerialDateTimeCommand" [ label="GetFormattedDateTimeFromCalculatedExcelSerialDateTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedUnixDateTimeCommand" [ label="GetFormattedDateTimeFromCalculatedUnixDateTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedTextDateTimeCommand" [ label="GetFormattedDateTimeFromCalculatedTextDateTimeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedDateTimeCommand" [ label="GetFormattedDateTimeFromCalculatedDateTimeCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.ADateTimeConvertCommands" -> "taskt.Core.Automation.Commands.IDateTimeConvertProperties";
"taskt.Core.Automation.Commands.AFormatDateTimeCommands" -> "taskt.Core.Automation.Commands.ADateTimeConvertCommands";
"taskt.Core.Automation.Commands.ACalculateDateTimeCommands" -> "taskt.Core.Automation.Commands.ADateTimeConvertCommands";
"taskt.Core.Automation.Commands.ConvertDateTimeToUnixTimelCommand" -> "taskt.Core.Automation.Commands.ADateTimeConvertCommands";
"taskt.Core.Automation.Commands.ConvertDateTimeToExcelSerialCommand" -> "taskt.Core.Automation.Commands.ADateTimeConvertCommands";
"taskt.Core.Automation.Commands.FormatDateTimeByUnixTimeCommand" -> "taskt.Core.Automation.Commands.AFormatDateTimeCommands";
"taskt.Core.Automation.Commands.FormatDateTimeByExcelSerialCommand" -> "taskt.Core.Automation.Commands.AFormatDateTimeCommands";
"taskt.Core.Automation.Commands.FormatDateTimeByTextCommand" -> "taskt.Core.Automation.Commands.AFormatDateTimeCommands";
"taskt.Core.Automation.Commands.FormatDateTimeCommand" -> "taskt.Core.Automation.Commands.AFormatDateTimeCommands";
"taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands" -> "taskt.Core.Automation.Commands.ACalculateDateTimeCommands";
"taskt.Core.Automation.Commands.CalculateDateTimeFromUnixTimeCommand" -> "taskt.Core.Automation.Commands.ACalculateDateTimeCommands";
"taskt.Core.Automation.Commands.CalculateDateTimeFromExcelSerialCommand" -> "taskt.Core.Automation.Commands.ACalculateDateTimeCommands";
"taskt.Core.Automation.Commands.CalculateDateTimeFromTextCommand" -> "taskt.Core.Automation.Commands.ACalculateDateTimeCommands";
"taskt.Core.Automation.Commands.CalculateDateTimeCommand" -> "taskt.Core.Automation.Commands.ACalculateDateTimeCommands";
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedExcelSerialDateTimeCommand" -> "taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands";
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedUnixDateTimeCommand" -> "taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands";
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedTextDateTimeCommand" -> "taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands";
"taskt.Core.Automation.Commands.GetFormattedDateTimeFromCalculatedDateTimeCommand" -> "taskt.Core.Automation.Commands.AGetFormattedDateTimeFromCalculatedDateTimeCommands";
}
